Revit 2026 API

# LabelUtilsGetLabelForBuiltInParameter(ForgeTypeId) Method

---

Gets the user-visible name for a built-in parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelForBuiltInParameter(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Shared Function GetLabelForBuiltInParameter (
	parameterTypeId As ForgeTypeId
) As String
```
```cpp
public:
static String^ GetLabelForBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
static member GetLabelForBuiltInParameter :
        parameterTypeId : ForgeTypeId -> string
```

#### Parameters

parameterTypeId ForgeTypeId
     Identifier of the built-in parameter to get the user-visible name.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the built-in parameter cannot be found. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelForBuiltInParameter Overload

Autodesk.Revit.DB Namespace